# @Time : 2021/7/1 13:35
# @Author : WZG
# --coding:utf-8--

zigen = {'G': "王旁青头戋五一", 'F': "土士二干十寸雨",
         'D': "大犬三羊古石厂", 'S': "木丁西", 'A': "工干草头右框七",
         'H': "目具上止卜虎皮", 'J': "日早两竖与虫依",
         'K': "口与川，字根稀", 'L': "田甲方框四车力",
         'M': "山由贝，下框几", 'T': "禾竹一撇双人立",
         'R': "反文条头共三一", 'E': "月彡乃用家衣底",
         'W': "人和八，三四里", 'Q': "金勺缺点无尾鱼，犬旁留右一点夕，氏无七",
         'Y': "言文方广在四一", 'U': "立辛两点六门疒",
         'I': "水旁兴头小倒立", 'O': "火业头，四点米",
         'P': "之宝盖，摘示衣", 'N': "已半巳满不出己",
         'B': "了耳了也框向上", 'V': "女刀九臼山朝西",
         'C': "又巴马，丢失矣", 'X': "慈母无心弓和匕，幼无力"}

while True:
    try:
        print('请输入字母：')
        x = input().upper()
        print(zigen[x])

    except:
        print('五笔没Z')
        break
